<?php
// Το παρόν πρόγραμμα δέχεται έναν Α.Μ. υπαλλήλου και δημιουργεί νέο μυστικό
// κωδικό για τον συγκεκριμένο υπάλληλο. Κατόπιν αποστέλλει μήνυμα στο email
// του υπαλλήλου με το οποίο τον ενημερώνει ότι δημιουργήθηκε νέος μυστικός
// κωδικός. Στο ίδιο μήνυμα αποστέλλεται και ο νέος κωδικός, οπότε ο υπάλληλος
// μπορεί να εισέλθει στην εφαρμογή χρησιμοποιώντας αυτόν τον κωδικό και
// κατόπιν να τον αλλάξει σε κάτι το οποίο ενδεχομένως να τον βολεύει καλύτερα.
//
// Εφόσον όλα πάνε καλά, το πρόγραμμα εκτυπώνει το AJXRSPOK code, αλλιώς
// εκτυπώνει μήνυμα λάθους κάνοντας exit με μηδενικό exit status, ενώ σε
// περίπτωση αστοχίας, το πρόγραμμα κάνει exit με μη μηδενικό exit status.

require_once "../lib/standard.php";
Globals::header_data();

if (Globals::no_session(PUBKEY))
Globals::klise_fige(0, "Ακαθόριστο δημόσιο κλειδί");

$ipalilos = Globals::perastike_must("ipalilos");

// Ως ελάχιστο μέτρο ασφαλείας ελέγχεται το δημόσιο κλειδί του υπαλλήλου,
// καθώς όποιος το γνωρίζει μπορεί να ζητήσει νέο κωδικό. Προκειμένου, λοιπόν,
// να ενισχύσουμε κατά το δυνατόν την ασφάλεια σε αυτό το σημείο, δημιουργούμε
// παράλληλα και νέο δημόσιο κλειδί. Αρχικά, πάντως, ελέγχουμε την τρέχουσα
// συνεδρία όσον αφορά στην ορθότητα του τρέχοντος δημόσιου κλειδιού.

$pubkey = Globals::session_get(PUBKEY);

$prosvasi = (new Prosvasi())->
pubkey_set($pubkey)->
ipalilos_set($ipalilos)->
prosvasi_fetch();

if ($prosvasi->ipalilos != $ipalilos)
Globals::klise_fige(0, "Ακαθόριστη εγγραφή πρόσβασης υπαλλήλου");

$ipalilos = (new Ipalilos())->
ipalilos_fetch($ipalilos);

if ($ipalilos->kodikos != $prosvasi->ipalilos)
Globals::klise_fige(0, "Ακαθόριστος αρ. μητρώου υπαλλήλου");

// Προκειμένου να αποσταλεί email στον υπάλληλο, επιλέγουμε αρχικά την
// υπηρεσιακή διεύθυνση ηλεκτρονικού ταχυδρομείου του υπαλλήλου.

$email = Globals::email_check($ipalilos->ipemail);

// Σε περίπτωση που η υπηρεσιακή διεύθυνση ηλεκτρονικού ταχυδρομείου δεν έχει
// καθοριστεί, χρησιμοποιούμε το προσωπικό email του υπαλλήλου.

if (!isset($email))
$email = Globals::email_check($ipalilos->premail);

if (!isset($email))
Globals::klise_fige(0, "Δεν υπάρχει διεύθυνση ηλεκτρονικού ταχυδρομείου");

// Δημιουργούμε τυχαίο string ικανού μήκους και το χρησιμοποιούμε ως νέο
// μυστικό κωδικό. Κρυπτογραφούμε με sha1 τον νέο μυστικό κωδικό προκειμένου
// να τον αποθηκεύσουμε στον πίνακα προσβάσεων για τον συγκεκριμένο υπάλληλο,
// ενώ παράλληλα θέτουμε τον κρυπτογραφημένο κωδικό ως public key, καθώς κάτι
// τέτοιο δεν δημιουργεί κάποιο θέμα ασφάλειας. Ωστόσο είναι καλό ο υπάλληλος
// να αλλάξει τον κωδικό που θα του αποσταλεί, αμέσως μετά την επανείσοδό του
// στην εφαρμογή με τον νέο μυστικό κωδικό.

$password = Globals::random_string(10, 14);
$pubkey = sha1($password);
$spubkey = Globals::asfales_sql($pubkey);

$query = "UPDATE `erpota`.`prosvasi` SET" .
	" `pubkey` = " . $spubkey . "," .
	" `password` = " . $spubkey .
	" WHERE `ipalilos` = " . $ipalilos->kodikos;
Globals::query($query);

if (Globals::affected_rows() < 0)
Globals::klise_fige(0, "Απέτυχε η δημιουργία νέου μυστικού κωδικού");

// Έχει ενημερωθεί η εγγραφή του υπαλλήλου στον πίνακα προσβάσεων και είναι ώρα
// να στείλουμε το email με το οποίο θα πληροφορήσουμε τον υπάλληλο σχετικά με
// την αλλαγή του δημόσιου κλειδιού και του μυστικού κωδικού που τον αφορούν.
// Στο μήνυμα, εκτός από τον μυστικό κωδικό, συμπεριλαμβάνεται και το link
// προς την εφαρμογή, όπου εμπεριέχεται το δημόσιο κλειδί ως παράμετρος
// "pubkey". Καλό είναι, λοιπόν, ο χρήστης να κρατήσει το εν λόγω link ως
// σελιδοδείκτη προκειμένου να μπορεί να επισκέπτεται τη σελίδα χωρίς να
// συμπληρώνει το δημόσιο κλειδί, πράγμα εξάλλου επίπονο και χρονοβόρο.

$msg = '<p>Ο νέος μυστικός κωδικός σας για την εφαρμογή <em>kartel</em> ' .
'είναι: <code style=\\"font-size:16px;font-weight:bold;\\">' . $password .
'</code></p><p>Αφού <a target=\\"_blank\\" href=\\"' . Globals::url("isodos") .
'?pubkey=' . $pubkey . '\\">συνδεθείτε</a>, μπορείτε να αλλάξετε τον μυστικό ' .
'κωδικό σας κάνοντας κλικ στο ονοματεπώνυμό σας, στο επάνω δεξιά μέρος της ' .
'σελίδας.</p>';

switch (Globals::sendmail($email, "Νέος μυστικός κωδικός", $msg)) {
case 0:
	Globals::klise_fige(0, AJXRSPOK);
case ERROR_MAILCONF:
	Globals::klise_fige(0, "Απέτυχε η ανάγνωση του mail configuration file");
case ERROR_RCPADDR:
	Globals::klise_fige(0, $email . ": λανθασμένη διεύθυνση ηλεκτρονικού ταχυδρομείου");
case ERROR_NULLMSG:
	Globals::klise_fige(0, "Επιχειρήθηκε αποστολή κενού μηνύματος ηλεκτρονικού ταχυδρομείου");
case ERROR_SENDMAIL:
	Globals::klise_fige(0, "Απέτυχε η αποστολή νέου μυστικού κωδικού");
}

Globals::klise_fige(1);
?>
