USE `erpota`
;

TRUNCATE `excuse`
;

ALTER TABLE `excuse` MODIFY `logos` ENUM (
	'ΕΝΤΑΞΕΙ',

	'ΑΣΘΕΝΕΙΑ',
	'ΓΟΝΙΚΗ',
	'ΑΙΜΟΔΟΣΙΑ',

	'ΚΑΡΤΑ/ΑΝΕΥ',
	'ΚΑΡΤΑ/ΑΠΩΛΕΙΑ',
	'ΚΑΡΤΑ/ΒΛΑΒΗ',
	'ΚΑΡΤΑ/ΚΛΟΠΗ',

	'ΕΟΡΤΗ',
	'ΣΤΑΣΗ',
	'ΑΠΕΡΓΙΑ',
	'ΣΥΝΔΙΚΑΛΙΣΜΟΣ',

	'ΕΚΠΑΙΔΕΥΣΗ',
	'ΔΙΚΑΣΤΗΡΙΟ',
	'ΠΕΝΘΟΣ',
	'ΘΑΝΑΤΟΣ',

	'ΑΛΛΗ ΑΙΤΙΑ'
) NULL DEFAULT NULL COMMENT 'Αιτιολογία'
;

TRUNCATE `adia`
;

ALTER TABLE `adia` MODIFY `idos` ENUM (
	'ΚΑΝΟΝΙΚΗ',
	'ΓΟΝΙΚΗ',
	'ΑΝΑΡΡΩΤΙΚΗ Υ/Δ',
	'ΑΣΘΕΝΕΙΑ',
	'ΑΣΘΕΝΕΙΑ ΤΕΚΝΟΥ',

	'ΑΙΜΟΔΟΣΙΑ',
	'ΡΕΠΟ ΑΙΜΟΔΟΣΙΑΣ',
	'ΡΕΠΟ ΥΠΕΡΩΡΙΑΣ',
	'ΣΥΝΔΙΚΑΛΙΣΤΙΚΗ',
	'ΕΚΠΑΙΔΕΥΤΙΚΗ',
	'ΠΕΝΘΟΣ',
	'ΔΙΚΑΣΤΗΡΙΟ',

	'ΑΝΕΥ ΑΠΟΔΟΧΩΝ',
	'ΑΠΟΣΠΑΣΗ',
	'ΠΑΡΑΙΤΗΣΗ',
	'ΑΠΟΛΥΣΗ',
	'ΣΥΝΤΑΞΙΟΔΟΤΗΣΗ',
	'ΛΥΣΗ ΣΧ. ΕΡΓ.',

	'ΕΙΔΙΚΗ ΑΔΕΙΑ'
) NULL DEFAULT NULL COMMENT 'Είδος αδείας'
;
