<?php
require_once "../lib/standard.php";
Globals::www_require("lib/selida.php");

Selida::head();
Selida::stylesheet("welcome/selida");
Selida::javascript("welcome/selida");

Selida::body();
Selida::toolbar();
Selida::fyi_pano();
Selida::ofelimo_open();
?>
<div class="kimeno">
<p>
<div class="titlos">
Καλωσήλθατε στο <strong>kartel</strong>!
</div>
</p>

<p>
Το σύστημα <em>kartel</em> αφορά στην καταγραφή, διαχείριση και επεξεργασία των
χρονικών δεδομένων προσέλευσης και αποχώρησης των εργαζομένων στο Δήμο
Θεσσαλονίκης.
Τα δεδομένα παράγονται από το δίκτυο καρταναγνωστών του Δήμου Θεσσαλονίκης κάθε
φορά που κάποιος υπάλληλος «περνάει» την κάρτα του από καρταναγνώστη εισόδου,
εξόδου, ή ακόμη και από καρταναγνώστες πρόσβασης σε φυλασσόμενους χώρους.
Οι καρταναγνώστες είναι εγκατεστημένοι στο
Δημαρχιακό Μέγαρο και επί του παρόντος υπάρχουν καρταναγνώστες
στα κτίρια της Κεντρικής Βιβλιοθήκης και του Κέντρου Ιστορίας.
Στο προσεχές μέλλον προβλέπεται η επέκταση του δικτύου και σε άλλα
δημοτικά κτίρια στα οποία στεγάζονται πολυπληθείς Υπηρεσίες του Δήμου
Θεσσαλονίκης, π.χ. Βιώσιμη Κινητικότητα, Αρχιτεκτονικό, Δημοτικές Κοινότητες,
Σταθμός Μεταφόρτωσης Απορριμμάτων, Πρόνοια κλπ.
</p>
</div>
<?php
Selida::ofelimo_close();
Selida::fyi_kato();
Selida::ribbon();
Selida::telos();
?>
